benchmark/results/html-report/statistics.json
{
  "GET /api/listings?page=0&size=10" : {
    "transaction" : "GET /api/listings?page=0&size=10",
    "sampleCount" : 1756,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 310.91685649202714,
    "medianResTime" : 117.0,
    "minResTime" : 96.0,
    "maxResTime" : 5172.0,
    "pct1ResTime" : 152.0,
    "pct2ResTime" : 176.29999999999973,
    "pct3ResTime" : 5114.43,
    "throughput" : 50.3888203391776,
    "receivedKBytesPerSec" : 441.11316075246066,
    "sentKBytesPerSec" : 8.758994160521107
  },
  "GET /api/search?keyword=tai nghe" : {
    "transaction" : "GET /api/search?keyword=tai nghe",
    "sampleCount" : 893,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 336.917133258678,
    "medianResTime" : 187.0,
    "minResTime" : 122.0,
    "maxResTime" : 5313.0,
    "pct1ResTime" : 276.0,
    "pct2ResTime" : 316.29999999999995,
    "pct3ResTime" : 5162.12,
    "throughput" : 26.09813835228103,
    "receivedKBytesPerSec" : 268.46918084395185,
    "sentKBytesPerSec" : 4.969860330756641
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 13279,
    "errorCount" : 3,
    "errorPct" : 0.022592062,
    "meanResTime" : 338.8963777392866,
    "medianResTime" : 112.0,
    "minResTime" : 90.0,
    "maxResTime" : 10027.0,
    "pct1ResTime" : 179.0,
    "pct2ResTime" : 286.0,
    "pct3ResTime" : 5120.0,
    "throughput" : 200.43471041946538,
    "receivedKBytesPerSec" : 1309.3772582206304,
    "sentKBytesPerSec" : 34.45630478690887
  },
  "GET /api/categories" : {
    "transaction" : "GET /api/categories",
    "sampleCount" : 1974,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 269.30648429584573,
    "medianResTime" : 106.0,
    "minResTime" : 92.0,
    "maxResTime" : 5142.0,
    "pct1ResTime" : 126.0,
    "pct2ResTime" : 143.0,
    "pct3ResTime" : 5105.25,
    "throughput" : 56.47907069897857,
    "receivedKBytesPerSec" : 138.27444359603444,
    "sentKBytesPerSec" : 9.100631509112757
  },
  "GET /api/listings (stress)" : {
    "transaction" : "GET /api/listings (stress)",
    "sampleCount" : 5912,
    "errorCount" : 2,
    "errorPct" : 0.0338295,
    "meanResTime" : 403.3497970230041,
    "medianResTime" : 111.0,
    "minResTime" : 94.0,
    "maxResTime" : 10027.0,
    "pct1ResTime" : 147.0,
    "pct2ResTime" : 5096.0,
    "pct3ResTime" : 5121.0,
    "throughput" : 89.23638888469608,
    "receivedKBytesPerSec" : 780.9782175457728,
    "sentKBytesPerSec" : 15.506546599296612
  },
  "GET /actuator/health" : {
    "transaction" : "GET /actuator/health",
    "sampleCount" : 1258,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 237.84022257551666,
    "medianResTime" : 101.0,
    "minResTime" : 90.0,
    "maxResTime" : 5123.0,
    "pct1ResTime" : 117.0,
    "pct2ResTime" : 135.0999999999999,
    "pct3ResTime" : 5099.41,
    "throughput" : 37.01306343415323,
    "receivedKBytesPerSec" : 17.85591146139814,
    "sentKBytesPerSec" : 6.000164580145934
  },
  "GET /api/community/posts" : {
    "transaction" : "GET /api/community/posts",
    "sampleCount" : 1486,
    "errorCount" : 1,
    "errorPct" : 0.067294754,
    "meanResTime" : 294.71736204576024,
    "medianResTime" : 139.0,
    "minResTime" : 100.0,
    "maxResTime" : 10015.0,
    "pct1ResTime" : 192.0,
    "pct2ResTime" : 219.64999999999986,
    "pct3ResTime" : 5126.13,
    "throughput" : 43.649394900716715,
    "receivedKBytesPerSec" : 147.12388517433322,
    "sentKBytesPerSec" : 7.582386488808601
  }
}