benchmark/results/tc-pt02-categories/html-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2574,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 210.98873348873326,
    "medianResTime" : 100.0,
    "minResTime" : 90.0,
    "maxResTime" : 5123.0,
    "pct1ResTime" : 108.0,
    "pct2ResTime" : 109.0,
    "pct3ResTime" : 5099.25,
    "throughput" : 73.9442688882505,
    "receivedKBytesPerSec" : 181.0334786160586,
    "sentKBytesPerSec" : 11.91484801422005
  },
  "GET /api/categories" : {
    "transaction" : "GET /api/categories",
    "sampleCount" : 2574,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 210.98873348873326,
    "medianResTime" : 100.0,
    "minResTime" : 90.0,
    "maxResTime" : 5123.0,
    "pct1ResTime" : 108.0,
    "pct2ResTime" : 109.0,
    "pct3ResTime" : 5099.25,
    "throughput" : 73.9442688882505,
    "receivedKBytesPerSec" : 181.0334786160586,
    "sentKBytesPerSec" : 11.91484801422005
  }
}